#include <iostream>
#include <stdio.h>
using namespace std; 
 
int main() 
{ 
   int num, remainder, b=0,i=0; 
    cin >> num; // ввід числа(наприклад 23)
    while (num > 0) 
    { 
        remainder = num % 10;//знайдемо остачу від числа(3)(за другим кругом а=2)
        b = b * 10 + remainder;//(за першим кругом b=3)(за другим кругом b=32)
        num = num / 10;//зменшимо num=2
        if((b%10)>3){// якщо число при розділенні на одиничні числа більше трьох то 
          i++;  // підрахунок таких чисел  (в нашому випадку цикл не спрацює)      
        }
    } 
  //після двох кругів виходимо, перейдемо до наступного циклу(згідно прикладу)
    while (b > 0) 
    { 
        cout <<b%10<<","; // виконуємо відокремлення по десятках через кому
        b = b / 10; 
    } 
    cout<<endl<<i;// вивід підрахованих чисел
    
}